# Core utilities
brew "git"
brew "git-delta"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "bat"
brew "zoxide"
brew "jq"
brew "eza"  # Modern ls replacement

# Development
brew "neovim"
brew "starship"
brew "node"
brew "fnm"  # Fast Node Manager

# Terminal
brew "wezterm"
brew "nushell"

# Additional tools
brew "lazygit"
brew "gh"  # GitHub CLI
